brew "ack"
brew "eye-d3"
brew "fd"
brew "ffmpeg", args: ["with-libvpx"]
brew "findutils"
brew "fish"
brew "fzf"
brew "git"
brew "gnupg"
brew "imagemagick", args: ["with-webp"]
brew "jenv"
brew "maven"
brew "rbenv"
brew "node"
brew "stow"
brew "yarn"
