brew "ack"
brew "broot"
brew "dos2unix"
brew "duti"
brew "eye-d3"
brew "fasd"
brew "fd"
brew "ffmpeg", args: ["with-libvpx"]
brew "findutils"
brew "fish"
brew "fzf"
brew "git"
brew "gradle"
brew "gnupg"
brew "imagemagick", args: ["with-webp"]
brew "jenv"
brew "macvim"
brew "maven"
brew "nvm"
brew "nmap"
brew "rbenv"
brew "node"
brew "the_silver_searcher"
brew "stow"
brew "terraform"
brew "yarn"

cask "docker"
cask "iterm2"
