tap "homebrew/cask-fonts"
tap "hashicorp/tap"

# The awesome Hack Nerd fonts combining the Hack source code font
# -  https://github.com/source-foundry/Hack
# with the Nerd aggregation of icons - https://www.nerdfonts.com/
#
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"

#
# core tools
#
# - bat - a prettier cat
# - coreutils - gnu core utilities
# - fd - alternative to find
# - fish - friendly interactive shell
# - mas - mac app store command line
# - stow - link farming
# - the_silver_searcher - ack, recursive grep alternative a.k.a ag
# - tmux - terminal multiplexer


# brew "podman"
# brew "busted"
brew "ack"
brew "bash"
brew "bat"
brew "bats-core"
brew "broot"
brew "code-minimap"
brew "coreutils"
brew "dos2unix"
brew "exa"
brew "fasd"
brew "fd"
brew "findutils"
brew "fish"
brew "git-crypt"
brew "glow"
brew "gnupg"
brew "htop"
brew "httpie"
brew "lastpass-cli"
brew "mas"
brew "neovim"
brew "nmap"
brew "nnn"
brew "pass"
brew "procs"
brew "ripgrep"
brew "rustup"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "watch"
brew "wget"
cask "kitty"

#
# linitng tools
#

# brew "languagetool"
brew "yamllint"
brew "vale"

#
# supporting tools
#
# - fzf - fuzzy file name searcher, powering vi plugin

brew "fzf"

#
# macos tools
#
# * duti - externision to tool mapping configuration
#

brew "duti"
brew "pinentry-mac"

cask "alfred"
cask "hiddenbar"

#
# office tools
brew "pandoc"
cask "drawio"

#
# dev tools
#

brew "bitwarden-cli"
brew "gh"
brew "git"
brew "gradle"
brew "hashicorp/tap/terraform-ls"
brew "jenv"
brew "jq"
brew "lua-language-server"
brew "node"
brew "npm"
brew "nvm"
brew "k9s"

brew "maven"
brew "neofetch"
brew "rbenv"
brew "terragrunt"
brew "tidy-html5"
brew "warrensbox/tap/tfswitch"
brew "warrensbox/tap/tgswitch"
brew "watchman"

cask "visual-studio-code"
cask "google-cloud-sdk"
cask "lens"

#
# media tools
#

brew "catimg"
brew "eye-d3"
# brew "ffmpeg", args: ["with-libvpx"]
# brew "imagemagick", args: ["with-webp"]
