tap "homebrew/cask-fonts"
tap "hashicorp/tap"
tap "bats-core/bats-core"

# The awesome Hack Nerd fonts combining the Hack source code font
# -  https://github.com/source-foundry/Hack
# with the Nerd aggregation of icons - https://www.nerdfonts.com/
#
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
# cask "font-symbols-only-nerd-font"

#
# core tools
#
# - bat - a prettier cat
# - coreutils - gnu core utilities
# - fd - alternative to find
# - fish - friendly interactive shell
# - mas - mac app store command line
# - stow - link farming
# - the_silver_searcher - ack, recursive grep alternative a.k.a ag
# - tmux - terminal multiplexer

# brew "podman"
# brew "busted"
brew "ack"
brew "bash"
brew "bat"
brew "bats-assert"
brew "bats-core"
brew "bats-support"
brew "broot"
brew "btop"
brew "code-minimap"
brew "coreutils"
brew "dos2unix"
# Should use eza instead of exa
# brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "git-crypt"
brew "glow"
brew "gnupg"
brew "htop"
brew "httpie"
brew "mas"
brew "neovim"
brew "nmap"
brew "nnn"
brew "pass"
brew "procs"
brew "ripgrep"
brew "rustup"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "the_silver_searcher"
# tidy-viewer (tv command) is a CSV pretty printer
brew "tidy-viewer"
brew "tig"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"
brew "watch"
brew "wget"
brew "zoxide"

cask "kitty"
cask "iterm2"
cask "rectangle"
cask "wezterm"

#
# Build chain tools
#

# brew "libxmlsec1"
brew "openblas"


#
# linitng tools
#

# brew "languagetool"
brew "yamllint"
brew "vale"

#
# supporting tools
#
# - fzf - fuzzy file name searcher, powering vi plugin

brew "fzf"

#
# macos tools
#
# * duti - externision to tool mapping configuration
#

brew "duti"
brew "pinentry-mac"

cask "alfred"
cask "hiddenbar"

#
# office tools
brew "qalculate-gtk"
brew "pandoc"
cask "drawio"

#
# dev tools
#

brew "automake"
brew "bitwarden-cli"
brew "direnv"
brew "gh"
brew "git"
brew "gitleaks"
brew "gpg"
brew "gradle"
brew "hashicorp/tap/terraform-ls"
brew "gum"
brew "http-server"
brew "jenv"
brew "jq"
brew "k9s"
brew "libpq"
brew "lua-language-server"
brew "lua"
brew "luarocks"
brew "maven"
brew "neofetch"
brew "node"
brew "npm"
brew "nvm"
brew "pinentry"
brew "pyenv"
brew "qalculate-gtk"
brew "rbenv"
brew "ruby-build"
brew "terragrunt"
brew "tidy-html5"
brew "warrensbox/tap/tfswitch"
brew "warrensbox/tap/tgswitch"
brew "watchman"

cask "db-browser-for-sqlite"
#
# Don't install google-cloud-sdk by brew since it asks for admin password and
# breaks non-interactive flow
#
# cask "google-cloud-sdk"
#
cask "lens"
#cask "libreoffice"
cask "visual-studio-code"

#
# media tools
#

brew "catimg"
brew "eye-d3"
# brew "ffmpeg", args: ["with-libvpx"]
brew "imagemagick"
